       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRJ3-First-Program.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT  STUDENT-FILE-IN
                     ASSIGN TO "STU-RECORD.TXT"
                       ORGANIZATION IS LINE SEQUENTIAL.
           SELECT  INDEXED-STUDENT-FILE
                     ASSIGN TO "INDEX-STU-RECORD.TXT"
                       ORGANIZATION IS INDEXED
                         RECORD KEY IS WS-STUDENT-NUMBER-OUT
                           ACCESS MODE IS SEQUENTIAL
                             FILE STATUS IS STATUS-FIELD.

       DATA DIVISION.
       FILE SECTION.
       FD  STUDENT-FILE-IN.
       01  STUDENT-RECORD-IN.
           05 WS-STUDENT-NUMBER  PIC 9(06).
           05 WS-STUDENT-NAME    PIC X(10).
           05 WS-STUDENT-SCORE    PIC 9(02).

       FD  INDEXED-STUDENT-FILE.
       01  STUDENT-RECORD-OUT.
           05 WS-STUDENT-NUMBER-OUT  PIC 9(06).
           05 WS-STUDENT-NAME-OUT    PIC X(10).
           05 WS-STUDENT-SCORE-OUT    PIC 9(02).

       WORKING-STORAGE SECTION.
       01  CONTROL-FIELD.
           05 EOF-FLAG      PIC X(3) VALUE "NO".
           05 VALID-FLAG    PIC X(3).
       01  STATUS-FIELD     PIC X(2).

       PROCEDURE DIVISION.
       100-CREATE-INDEXED-STUDENT-FILE.
           PERFORM   201-INITIALIZE-CREATE-FILE.
           PERFORM   202-CREATE-IND-STUDENT-RECORDS
                       UNTIL  EOF-FLAG = "YES".
           PERFORM   203-TERMINATE-PROGRAM.
           STOP RUN.
       201-INITIALIZE-CREATE-FILE.
           PERFORM  301-OPEN-STUDENT-FILES.
           PERFORM  302-READ-STUDENT-FILE-IN.

       202-CREATE-IND-STUDENT-RECORDS.
           PERFORM  303-WRITE-IND-STUDENT-RECORD.
           PERFORM  302-READ-STUDENT-FILE-IN.

       203-TERMINATE-PROGRAM.
           PERFORM 304-CLOSE-FILES.

       301-OPEN-STUDENT-FILES.
           OPEN INPUT  STUDENT-FILE-IN

           OPEN OUTPUT INDEXED-STUDENT-FILE.

       303-WRITE-IND-STUDENT-RECORD.
           WRITE  STUDENT-RECORD-OUT FROM STUDENT-RECORD-IN
           INVALID KEY PERFORM 401-ERROR-RTN.

       302-READ-STUDENT-FILE-IN.
           READ  STUDENT-FILE-IN
           AT END  MOVE "YES" TO EOF-FLAG.

       304-CLOSE-FILES.
           CLOSE STUDENT-FILE-IN   INDEXED-STUDENT-FILE.
       401-ERROR-RTN.
             DISPLAY "Not find key".

       END PROGRAM PRJ3-First-Program.