       IDENTIFICATION DIVISION.
       PROGRAM-ID. INDEX_TO_SEQUENTIAL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT  STUDENT-FILE-INDEX
                     ASSIGN TO "INDEX-STU-RECORD.TXT"
                       ORGANIZATION IS INDEXED
                         RECORD KEY IS WS-STUDENT-NUMBER-IN
                           ACCESS MODE IS SEQUENTIAL
                             FILE STATUS IS STATUS-FIELD-INDEX.

           SELECT  STUDENT-FILE-SEQUENTIAL
                     ASSIGN TO "SEQUENTIAL-STU-RECORD.TXT"
                       ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  STUDENT-FILE-INDEX.
       01  STUDENT-RECORD-INDEX.
           05 WS-STUDENT-NUMBER-IN  PIC 9(06).
           05 WS-STUDENT-NAME-IN    PIC X(10).
           05 WS-STUDENT-SCORE-IN    PIC 9(02).

       FD  STUDENT-FILE-SEQUENTIAL.
       01  STUDENT-RECORD-SEQUENTIAL.
           05 WS-STUDENT-NUMBER-OUT  PIC 9(06).
           05 WS-STUDENT-NAME-OUT    PIC X(10).
           05 WS-STUDENT-SCORE-OUT    PIC 9(02).

       WORKING-STORAGE SECTION.
           01 STATUS-FIELD-INDEX     PIC X(2).
           01 WS-EOF-SW           PIC X(01) VALUE 'N'.
               88 EOF-SW           VALUE 'Y'.
               88 NOT-EOF-SW       VALUE 'N'.

       LINKAGE SECTION.
           
       PROCEDURE DIVISION.
       100-CREATE-STUDENT-FILE.
           PERFORM   201-INITIALIZE-CREATE-FILE.
           PERFORM   202-READ-AND-WRITE-STUDENT-FILE-IN.
           PERFORM   203-TERMINATE-PROGRAM.
           PERFORM   305-RE-INIT-VARIABLE.
           GOBACK.
       201-INITIALIZE-CREATE-FILE.
           PERFORM  301-OPEN-STUDENT-FILES.

       203-TERMINATE-PROGRAM.
           PERFORM 304-CLOSE-FILES.

       301-OPEN-STUDENT-FILES.
           OPEN INPUT  STUDENT-FILE-INDEX.
           OPEN OUTPUT STUDENT-FILE-SEQUENTIAL.

       202-READ-AND-WRITE-STUDENT-FILE-IN.
           PERFORM UNTIL EOF-SW
               READ STUDENT-FILE-INDEX
               AT END 
                   MOVE 'Y' TO WS-EOF-SW
               NOT END
                   WRITE STUDENT-RECORD-SEQUENTIAL
                            FROM STUDENT-RECORD-INDEX
           END-PERFORM.
    
       304-CLOSE-FILES.
           CLOSE STUDENT-FILE-INDEX STUDENT-FILE-SEQUENTIAL.

       305-RE-INIT-VARIABLE.
           MOVE 'N' TO WS-EOF-SW.
       END PROGRAM INDEX_TO_SEQUENTIAL.