       IDENTIFICATION DIVISION.
       PROGRAM-ID. "SUB_UPDATE".

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-RECORD-FILE
               ASSIGN TO "INDEX-STU-RECORD.TXT"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS STUDENT-NUMBER
               FILE STATUS IS WS-FS.

       DATA DIVISION.
       FILE SECTION.
       FD  STUDENT-RECORD-FILE.
       01 STUDENT-RECORD.
           05 STUDENT-NUMBER  PIC 9(06).
           05 STUDENT-NAME    PIC X(10).
           05 STUDENT-SCORE    PIC 9(02).

       WORKING-STORAGE SECTION.
       01 WS-STUDENT-INFOR PIC X(50).
       01 WS-STUDENT-RECORD.
           05 WS-STUDENT-NUMBER  PIC 9(06).
           05 WS-STUDENT-NAME    PIC X(10).
           05 WS-STUDENT-SCORE    PIC 9(02).
       01 CONTROL-FIELDS.
           05 DICISION-FLAG    PIC X(3) VALUE "Y".
           05 WS-EOF PIC A(1).
       77 WS-FS               PIC 9(02).

       LINKAGE SECTION.
       PROCEDURE DIVISION.
       100-INIT.
           PERFORM 200-OPEN-FILES.
           PERFORM 201-READ-FILES.
           PERFORM 202-UPDATE-STUDENT-RECORD.
           PERFORM 204-CLOSE-FILES.
           GOBACK.

       101-INPUT-NUMBER.
           DISPLAY "STUDENT ID YOU WANT TO UPDATE?".
           ACCEPT WS-STUDENT-NUMBER.

       102-INPUT-SCORE.
           DISPLAY "STUDENT SCORE".
           ACCEPT WS-STUDENT-SCORE.

       200-OPEN-FILES.
           OPEN I-O STUDENT-RECORD-FILE.

       201-READ-FILES.
           PERFORM 101-INPUT-NUMBER.
           MOVE WS-STUDENT-NUMBER TO STUDENT-NUMBER.
           READ STUDENT-RECORD-FILE INTO WS-STUDENT-RECORD
                 KEY IS STUDENT-NUMBER
                 INVALID KEY
                    DISPLAY 'RECEORD KEY IS INVALID'
                 NOT INVALID KEY
                    DISPLAY 'REC : ' WS-STUDENT-RECORD
           END-READ.

       202-UPDATE-STUDENT-RECORD.
           PERFORM 102-INPUT-SCORE.
           MOVE WS-STUDENT-SCORE TO STUDENT-SCORE
           REWRITE STUDENT-RECORD
                INVALID KEY
                   DISPLAY 'RECEORD KEY IS INVALID'
                NOT INVALID KEY
                   DISPLAY 'NEW REC : ' STUDENT-RECORD
           END-REWRITE.

       204-CLOSE-FILES.
             CLOSE STUDENT-RECORD-FILE.


       END PROGRAM "SUB_UPDATE".