       IDENTIFICATION DIVISION.
       PROGRAM-ID. "SUB_ADD".

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT  STUDENT-INDEXED-FILE
                     ASSIGN TO "INDEX-STU-RECORD.TXT"
                       ORGANIZATION IS INDEXED
                         RECORD KEY IS STUDENT-NUMBER
                           ACCESS MODE IS SEQUENTIAL
                             FILE STATUS IS STATUS-FIELD.
       SELECT  STUDENT-SEQUENTIAL-FILE
                     ASSIGN TO "SEQUENTIAL-STU-RECORD.TXT"
                       ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  STUDENT-INDEXED-FILE.
       01 STUDENT-RECORD.
           05 STUDENT-NUMBER  PIC 9(06).
           05 STUDENT-NAME    PIC X(10).
           05 STUDENT-SCORE    PIC 9(02).

       FD  STUDENT-SEQUENTIAL-FILE.
       01 STUDENT-RECORD-SEQUENTIAL.
           05 STUDENT-NUMBER-SEQUENTIAL  PIC 9(06).
           05 STUDENT-NAME-SEQUENTIAL    PIC X(10).
           05 STUDENT-SCORE-SEQUENTIAL    PIC 9(02).

       WORKING-STORAGE SECTION.
       01 WS-STUDENT-INFORM      PIC X(50).
       01 WS-STUDENT-VALIDATE.
           05 WS-STUDENT-NUMBER-X    PIC X(06).
           05 WS-STUDENT-SCORE-X     PIC X(06).
       01 WS-STUDENT-RECORD.
           05 WS-STUDENT-NUMBER  PIC 9(06).
           05 WS-STUDENT-NAME    PIC X(10).
           05 WS-STUDENT-SCORE   PIC 9(02).
       01 CONTROL-FIELDS.
           05 DECISION-FLAG      PIC X(3) VALUE "Y".
           05 EOF-FLAG           PIC X(3) VALUE "NO".
       01  STATUS-FIELD          PIC X(2).

       LINKAGE SECTION.
       PROCEDURE DIVISION.
       100-PRODUCE-STUDENT-RECORDS.
           PERFORM 201-INITIATE-STUDENT-RECORD.
           PERFORM 202-ENTER-STUDENT-RECORD UNTIL DECISION-FLAG = "N".
           PERFORM 203-CLOSE-FILE.
           GOBACK.

       201-INITIATE-STUDENT-RECORD.
           PERFORM 301-OPEN-FILE.
           PERFORM 305-WRITE-ALL-FROM-SEQUENTIAL-TO-INDEXED.

       202-ENTER-STUDENT-RECORD.
           PERFORM 303-INPUT-DATA.
           PERFORM 306-VALIDATE-INPUT.
           PERFORM 304-WRITE-DATA.
           PERFORM 302-PROMPT-WHETHER-ENTER-RECORD.

       203-CLOSE-FILE.
           CLOSE STUDENT-INDEXED-FILE STUDENT-SEQUENTIAL-FILE.
           MOVE "Y" TO DECISION-FLAG.
           MOVE "N" TO EOF-FLAG.

       301-OPEN-FILE.
           OPEN OUTPUT STUDENT-INDEXED-FILE.
           OPEN INPUT STUDENT-SEQUENTIAL-FILE.

       302-PROMPT-WHETHER-ENTER-RECORD.
           DISPLAY "WANT TO ADD MORE? Y/N".
           ACCEPT DECISION-FLAG.
 
       303-INPUT-DATA.
           DISPLAY "ENTER STUDENT INFORMATION (FORMAT: ID-NAME-SCORE)".
           ACCEPT WS-STUDENT-INFORM.

           UNSTRING WS-STUDENT-INFORM DELIMITED BY '-'
               INTO WS-STUDENT-NUMBER-X, WS-STUDENT-NAME, 
                                           WS-STUDENT-SCORE-X
           END-UNSTRING.

       304-WRITE-DATA.
           WRITE  STUDENT-RECORD FROM WS-STUDENT-RECORD
           INVALID KEY PERFORM 401-ERROR-RTN.

       305-WRITE-ALL-FROM-SEQUENTIAL-TO-INDEXED.
           PERFORM UNTIL EOF-FLAG='Y'
             READ STUDENT-SEQUENTIAL-FILE INTO STUDENT-RECORD-SEQUENTIAL
                AT END MOVE 'Y' TO EOF-FLAG
                NOT AT END 
                    WRITE STUDENT-RECORD FROM STUDENT-RECORD-SEQUENTIAL
             END-READ
           END-PERFORM.

       306-VALIDATE-INPUT.
           PERFORM 307-VALIDATE-STUDENT-ID.
           PERFORM 308-VALIDATE-STUDENT-SCORE.

       307-VALIDATE-STUDENT-ID.
           INSPECT WS-STUDENT-NUMBER-X REPLACING LEADING SPACES BY '0'
           IF FUNCTION TRIM(WS-STUDENT-NUMBER-X) IS NUMERIC
              COMPUTE WS-STUDENT-NUMBER 
                   = FUNCTION NUMVAL(WS-STUDENT-NUMBER-X)
           ELSE 
               DISPLAY "STUDENT'S ID MUST BE NUMBER, PLZ ENTER AGAIN..."
               GO TO 303-INPUT-DATA
           END-IF.

       308-VALIDATE-STUDENT-SCORE.
           INSPECT WS-STUDENT-SCORE-X REPLACING LEADING SPACES BY '0'
           IF FUNCTION TRIM(WS-STUDENT-SCORE-X) IS NUMERIC
              COMPUTE WS-STUDENT-SCORE 
                   = FUNCTION NUMVAL(WS-STUDENT-SCORE-X)
           ELSE 
               DISPLAY "STUDENT'S SCORE MUST BE NUMBER, PLZ ENTER AGAIN"
               GO TO 303-INPUT-DATA
           END-IF.
           

       401-ERROR-RTN.
             DISPLAY "Not find key".

       END PROGRAM "SUB_ADD".